[update](parser) README.md
mermaidを使って構成図を書いた
